; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(pointing satellite0 Planet11)
	(have_image Phenomenon5 spectrograph0)
	(have_image Star6 spectrograph0)
	(have_image Star7 spectrograph0)
	(have_image Planet8 image1)
	(have_image Star9 image1)
	(have_image Star10 image1)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 image1)
))

)

; plan
1. (turn_to satellite0 star0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star0)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 star10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star10)
   goals met: 0 of 9
5. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 1 of 9
6. (turn_to satellite0 planet8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet8)
   goals met: 1 of 9
7. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 2 of 9
8. (turn_to satellite0 planet12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet12)
   goals met: 2 of 9
9. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon5 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon5 instrument0 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 4 of 9
12. (turn_to satellite0 star6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star6)
   goals met: 4 of 9
13. (take_image satellite0 star6 instrument0 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 5 of 9
14. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 5 of 9
15. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 6 of 9
16. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 6 of 9
17. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 7 of 9
18. (turn_to satellite0 planet11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet11)
   goals met: 8 of 9
19. (take_image satellite0 planet11 instrument0 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 9 of 9
